Revit 2024 API
RebarPropagation Methods
The RebarPropagation type exposes the following members.
Methods
Name | Description
AlignByFace
 It will copy the source rebars, will align them to the destination face based on the source face and adapt them to destination host.
AlignByHost
 It will copy the source rebars, will align them in the same way as how the source host is aligned to destination host and will adapt them to the destinaion host.
See Also
RebarPropagation Class
Autodesk.Revit.DB.Structure Namespace